#!/usr/bin/perl

# Этот исходник посвящается программистам 1с приходящим на собеседование

sub обождать_пять_менут
{
    foreach my $менута (0 .. 4)
    {
        say "Ожидаем $менута менуту";
        обождать_менуту();
    }
}

sub обождать_менуту
{
    my $время_начала = time;

    while(time - $время_начала < 60){}
}

my $раздватри;
my $_раздватри;
my $oneдватри;
my $_oneдватри;

package Foo;
sub раздватри{}
sub _раздватри{}
sub oneразд123ватри{}
sub _разд123one_ватри{}

package main;

say Foo::раздватри();
say Foo::_раздватри();
say Foo->раздватри();
say Foo->_раздватри();
say Foo::oneразд123ватри();
say Foo->oneразд123ватри();
